//
//  BlogData.swift
//  Blog
//
//  Created by dmdm on 24/10/2021.
//

import UIKit

struct Blog {
    let image: String
    var caption = "Blog"
    let title: String
    let desc: String
    let name: String
    let logo: String
    var author: String
    var authorName: String
}


class BlogPosts {
    

    static let posts = [
    Blog(
    image: "نيتشه",
    title: "اقتباسات نيتشه: أقوال وحكم ستتحدى أفكارك",
    desc: "ما لا يقتُلنا يجعلُنا أقوى إن كنت تظنّ أنّ الحياة صعبة، فعليك بالاستمرار. لا تبحث عن الحياة السهلة بل ابحث عن القوّة. لطالما ركّزت فلسفة نيتشه على ضرورة أن يكون المرء شجاعًا يخوض المخاطر ويواجه المواقف الصعبة حتى يتمكّن من جني ثمار الحياة. بالنسبة له لا مجال للعظمة والنجاح دون المرور بدرب الألم والتضحية من يقاتل الوحوش عليه أن يحذر كي لا يتحوّل إلى واحد منهم - نيتشه قد يضطرّ الجنود أثناء محاربتهم للإرهاب أن يتحوّلوا هم أيضًا إلى أشخاص قساة عديمي الرحمة، والأمر ينطبق أيضًا على الحياة اليومية الواقعية",
    name: "الفيلسوف نيتشه",
    logo: "نيتشه",
    author: "نيتشه",
    authorName: "نيتشه"),
 Blog (
    image: "بيل",
    title: "تطوير الذات",
    desc: "من هو بيل غيتس؟ بيل غيتس شخصيّة غنية عن التعريف، فهو أغنى رجل في العالم ومؤسس مايكروسوفت الشهيرة. تُقدّر ثروته بحوالي 100 مليار دولار في عام 2021. لذا من الطبيعي للغاية أن يرغب الجميع في معرفة السرّ وراء نجاحه المبهر هذا، وهو ما ستقرؤه في مقال اليوم على تعلّم ابدأ باكرا قدر المستطاع الدرس الأول للنجاح الذي يمكنك أن تتعلّمه من بيل غيتس هو أن تبدأ باكرًا قدر المستطاع. وليس المقصود هنا الصباح الباكر! هل تعلم أنّ بيل غيتس بدأ العمل على الحواسيب منذ أن كان في سنّ الثالثة عشر؟ هذا هو المقصود بأن تبدأ باكرًا، فعندما تبدأ بالعمل لتحقيق طموحك في مرحلة مبكرة من عمرك، ستصبح أكثر ارتباطًا وتعلّقا به. لن يجعلك هذا الأمر أنجح من معظم الناس وحسب، بل سيجعلك أيضًا أقلّ رغبة في الاستسلام. عندما تبدأ في مرحلة مبكرة، ستكتسب مناعة تجاه الأشخاص الذين يثبّطونك أو يخبرونك بعدم قدرتك على تحقيق أمرٍ ما رحّب بالشراكات ،كان بيل غيتس مولعًا بتأسيس وبناء الشراكات مع الغير، خاصّة كبار الناجحين والمؤثّرين، والذين جعلوا منه تابعًا لهم. لكن غيتس كان سعيدًا بهذه الشراكات، لأنها فتحت أمامه فرصًا مذهلة ومنحته القدرة على تعلّم أشياء مهمّة من روّاد أعمال ناجحين. ليس هذا وحسب، هذه الشراكات كانت تعني أنه قد بنى علاقات وطيدة مع أشخاص سيقدّمون له يد العون حتمًا في مساعيه المستقبلية.",
    name: "بيل غيتس",
    logo: "بيل",
    author: "بيل",
    authorName: "بيل غيتس"),
Blog(
    image: "الخوف",
    title: "حبل الخوف قصير | كيف تتخلص من خوفك لتحقيق النجاح في حياتك",
    desc: "حتى نتخلص من دافع الخوف الذي يربط عمل الصواب بوجودالبعبع من غيابه، علينا أن نبدأ بأنفسنا وبمجتمعنا المصغر المتمثل بأُسرنا وأبنائنا، وأن نحرص على غرس أهمية اتباع الصواب وتأسيس الطفل على ربط الصواب بمصلحته ومصلحة من هم حوله، حتى يكون الصواب والمصلحة العامة هما الدافع المحرّك له، وليس الخوف.  بدلاً من ترديد عبارات التهديد والتخويف لأطفالنا يمكننا أن نعزّز وعيهم ليتأملوا تبعات أفعالهم بشكل ملموس، فإذا رأيت ما يسيء من التصرف منهم اجلس معهم واشرح لهم بلغة مبسطة ما سيتبعُ هذا هذا التصرف من نتائج قد تؤثر عليهم سلبًا مستقبلاً، وبإمكانك أيضًا أن توسّع مساحة الوعي لديهم وأن تشرح لهم كيف أنّ تصرّفهم  قد يؤذي باقي أفراد الأسرة حتى يعوا بذلك أهمية تأمّل نتائج أفعالهم على باقي أفرادالمجتمع. حينها سيقف الأبناء مستقبلاً أمام رف كتب التنمية الذاتية بوعي متكامل آملين وقادرين على إيجاد دوافع حقيقية تدفعهم للمزيد من الإبداع والتطوّر دون الاهتمام بعامل الخوف. وبإمكاننا أيضاً التغلب على عامل الخوف عند الإقبال على العمل من خلال تذكير أنفسنا أنّ ما ننجزه وننتجه كلّ يوم سيكون له الأثر الإيجابي على من حولنا من خلال خدمتهم ومساعدتهم على إتمام حاجتهم، ولا نحتاج للخوف أو الترهيب للمضي قدمًا في عملنا" ,
    name: "مدرب حياة",
    logo: "الخوف",
    author: "الخوف",
    authorName: "مدرب حياة"),
Blog (
    image: "دوستويفسكي",
    title: "أشهر اقوال دوستويفسكي العميقة",
    desc: "تعتبر أقوال دوستويفسكي واقتباساته فلسفات حياتية عظيمة وعميقة ستجعلك حتمًا تفكّر بعمق في العالم من حولك الأهم من كلّ شيء هو ألاّ تكذب على نفسك الرجل الذي يكذب على نفسه ويستمع لكذبته سيصل إلى مرحلة لن يتمكّن بعدها من تمييز الحقيقة في داخله أو من حوله، وهكذا سيفقد كلّ احترامه لذاته وللآخرين. ومع افتقاده للاحترام، سيتوقّف عن الحب الألم والمعاناة أمران لا مفرّ منهما للوصول إلى ذكاء كبير وقلب عميق لم أؤمن أبدًا ولن أؤمن إطلاقًا بأنّ الشرّ هو السمة الطبيعية لدى بني البشر كلمّا كان الليل أشدّ ظلمة، كانت النجوم أكثر سطوعًارتُشفى الروح من خلال التواجد مع الأطفال",
    name: "دوستويفسكي",
    logo: "دوستويفسكي",
    author: "دوستويفسكي",
    authorName: "دوستويفسكي"
)
]
}
