//
//  BlogPosts.swift
//  Hanan-projectFLOG
//
//  Created by  HANAN ASIRI on 16/03/1443 AH.
//

import Foundation
 
struct BlogPosts : Identifiable {
      
    var id : Int
    var name : String
    var image : String
    var details : String
}
  
var latestpost = [
  
    BlogPosts(id: 0, name: " الكبسة السعودية", image: "2", details: "سكب الأزر في طبق تقديم واسع ووضع الفخذ في الوسط. توزيع اللوز والزبيب وتقديم الكبسة مع الدقوس أو السلطة. كبسة الدجاج بالزعفران. مدّة الطهي, أربعون دقيقة."),
    
    
    BlogPosts(id: 1, name: "مكرونة فوتشيني ايطالية", image: "6", details: " الباستا ذات الشعبية الكبيرة في المطبخ الروماني. عند الحديث عن إيطاليا فأول شيء يتبادر لأذهاننا هو الطعام اللذيذ الذي يشتهر به هذا البلد  المضياف الذي يأتيه ملايين الزوار من جميع دول العالم، لتذوق أطباقه الشهية."),
    
    BlogPosts(id: 2, name: "البرجر الامريكي ", image: "8",  details: "اكلة أمريكية كثيراً ما تعد من الوجبات السريعة وقد انتشرت بسرعة في كل أنحاء العالم حتى أصبحت من وجبات العولمة، تتكون من ساندويتش من اللحم أو الدجاج بالإضافة إلى الكاتشاب والمايونيز والخضار، ويأكل معها البطاطا المقلية والمشروبات الغازية "),
    
    
    BlogPosts(id: 3, name: "البيتزا الايطالية", image: "9", details: "تعود أصولها إلى دول شرق البحر الأبيض المتوسط كاليونان وتركيا حيث كانوا يقومون بإنضاج طبقة من العجين على حجر ساخن ويغطونها بأنواع المكونات المختلفة مثل اللحم والخضروات،")
]
 
var featuredpost = [
  
    BlogPosts(id: 0, name: "الكبسة السعودية", image: "2", details: "سكب الأزر في طبق تقديم واسع ووضع الفخذ في الوسط. توزيع اللوز والزبيب وتقديم الكبسة مع الدقوس أو السلطة. كبسة الدجاج بالزعفران. مدّة الطهي, أربعون دقيقة."),
    
    BlogPosts(id: 1, name: "البرقر الامريكي", image: "8", details: "اكلة أمريكية كثيراً ما تعد من الوجبات السريعة وقد انتشرت بسرعة في كل أنحاء العالم حتى أصبحت من وجبات العولمة، تتكون من ساندويتش من اللحم أو الدجاج بالإضافة إلى الكاتشاب والمايونيز والخضار، ويأكل معها البطاطا المقلية والمشروبات الغازية "),
]
