//
//  BlogBost.swift
//  Blog App-Afnan-week4
//
//  Created by Fno Khalid on 17/03/1443 AH.
//

import Foundation


struct BlogPosts : Identifiable {
      
    var id : Int
    var name : String
    var image : String
    var details : String
}

var latestpost = [
  
    BlogPosts(id: 0, name: "إيطاليا", image: "0", details: "تشتهر إيطاليا بطبق “الباستا”، وهي المكرونة ويقدم عليها العديد من الصوصات والتوابل والمكونات المختلفة، ومن أشهرها، طبق “باستا الأنجِل هير مع صوص الأماتريشانا”، ويتكون هذا الطبق من اللحم، والكوسة، والفول وطبق “بيتزا بافالينا”، والذي يتكون من العجينة الرقيقة والمحمّصة من الأطراف ويوضع عليها أنواع الفلفل، التين، الليمون، الفطر، والخضراوات الورقيّة والجبن موزاريلا بافالو، مع صوص طماطم سان مارزانو."),
    BlogPosts(id: 1, name: "انجلترا", image: "1", details: "ويتميز المطبخ الإنجليزي بطبق “Fish and Chips” أي السمك القد والبطاطس المقلية، والذي يعد واحد من أشهر الوجبات الإنجليزية، حيث يتم قلي السمك حتى يحصل على اللون الذهبي وعادة يتم إضافة البازلاء محمرة أو مهروسة إلى الطبق، وفي بعض الأحيان قد تجد طبق من حلقات البصل المحمرة كطبق جانبي ولكن يجب عليك أن تطلبه بنفسك."),
    BlogPosts(id: 2, name: "أسبانيا", image: "2", details: "أما أسبانيا فتتميز بالأومليت الأسباني Tortilla Espanola، يعد هذا الطبق واحد من أشهر و أحب الأطباق في أسبانيا، و مكوناته الأساسية هي : (البيض، البطاطس، و البصل المطبوخ في زيت الزيتون)، و هذا الطبق له أشكال عديدة حيث يوجد منه السميك و الرقيق.على الرغم من أنه يقال أن هذا الطبق سهل التحضير، إلى أنه واحدة من الأطباق التي تتطلب تقنية خاصة في طهيها."),
    BlogPosts(id: 3, name: "فرنسا", image: "3", details: "وإذا تحدثنا عن الأكلات العالمية لا بد من أن نذكر فرنسا، والتي تتميز عادة بالمعجنات وأشهرها الكرواسون ولكن طبق اليوم هو حساء البصل الفرنسي، حيث يتم صنع هذا الحساء التقليدي من البصل ومرقة اللحم، ويُقدم عادة مع الخبز المحمص والجبن الذائب على قمته. ويرجع أصل هذا الحساء إلى الرومان، وكان يعتبر من أطباق الفقراء. ويأتي المذاق الرائع في هذا الحساء من البصل المُشوح والمُكرمل والذي يتم طهوه ببطء، وعادةً ما يتم إضافة مرق اللحم أو الماء، كما يتم إضافة الحليب أو البيض أو الطحين لجعل قوام الحساء كثيف."),
    BlogPosts(id: 4, name: "ألمانيا", image: "4", details: "وختاماً للأكلات العالمية الأوروبية يأتي المطبخ اليوناني والذي يعد من المطابخ الرائعه التي تحمل الكثير من الخواص المشتركه مع مطابخ بعض الدول الأخري كالشرق الأوسط وإيطاليا، ولكنه يتميز بلمساته الخاصه التي تجعل أطعمته مميزه ولها نكهات خاصه جعلتها من الأطعمه الأشهر في العالم. ويعتمد المطبخ اليوناني في أطباقه علي الخضروات الطازجة وزيت الزيتون"),
    BlogPosts(id: 4, name: "كوريا", image: "5", details: "الكيمتشي kimchi طعام كوري تقليدي وأساسي لا تكاد تخلو منه مائدة فقير أو غني وهو عبارة عن طعام أشبه ما يكون بالمخلل عند العرب وأساسه مادة الملفوف والثوم الكثير والفلفل الأحمر الحار، الكيمتشي طعام تقليدي مخلل يحفظ في مكان دافئ ويمكن تناوله كمقبلات أو طبق ثانوي."),
    BlogPosts(id: 5, name: "البرازيل", image: "6", details: "يشتهر المطبخ البرازيلي بطبق Acarajé ، وهو طبق خفيف شهير يشبه الفلافل، ويعتبر هذا الطبق من أدسم الأطباق، ولكنه واحد من ألذ الأطباق التي من الممكن أن تتناولها. هذا الطبق مصنوع من اللوبياء المحشوة بمعجون الجمبري الحار، معجون الكاجو وزيت النخيل والتي يتم قليها في زيت النخيل."),
    BlogPosts(id: 6, name: "تركيا", image: "7", details: "الطبع عند المرور على المطبخ التركي لن نجد ما هو أكثر شهرة من الشاورما التركية أو الدونر كما يطلق عليها في تركيا، وهي من أشهر الأكلات العالمية. الشاورما أكلة تركية شعبية يعود أصلها إلي الإمبراطورية العثمانية، وتتكون من اللحم الأحمر أو قطع الدجاج المتبلة والموضوعة على سيخ، يتم شوائها وبعدها تقدم في وجبات أو خبز، وهي متوفرة في معظم المطاعم التركية."),
    BlogPosts(id: 7, name: "أمريكا", image: "8", details: "يشتهر المطبخ الأمريكي بالأكلات والوجبات السريعة، المحببة للأطفال والكبار معاً، ومنها الهوت دوج والبرجر، بالإضافة إلي حلوى الدونس المميزة. والجدير بالذكر أن المطبخ الأمريكي يتميز بإختلاف أطباقه وأذواقها، فهناك على سبيل المثال أطباق أوروبية تقدم بالمطبخ الأمريكي، ويرجع ذلك إلي تعدد الجنسيات المختلفة بأمريكا مما يجعلها مطبخاً يقدم كل الأكلات العالمية معاً."),
    BlogPosts(id: 8, name: "الدول العربية", image: "9", details: "ذا قمنا بهذه الجولة بين اكلات عالمية من مطابخ العالم أجمع، فلا يتسني لنا أن ننسي مطبخنا العربي الأصيل، والذي يتميز بمذاق فريد، إذ لكل دولة عربية طبقها الخاص الذي يعبر عن ثقافتها وتقاليدها ولكن اخترنا لكم طبق الكبسة وهو طبق متميز سعودي الأصل، ويعد من أشهر الأطباق العربية على الإطلاق. الكبسة من الأطباق الرئيسية التي تقدم في المناسبات والعزائم والإفطارات الرمضانية. ويتكون الطبق من شرائح اللحم، والأرز، وحب الحمص المسلوق،بالإضافة إلي البهارات والقرفة، ويزين بالزبيب واللوز.")
    
    
    
    ]

var featuredpost = [
  
    BlogPosts(id: 0, name: "إيطاليا", image: "0", details: "تشتهر إيطاليا بطبق “الباستا”، وهي المكرونة ويقدم عليها العديد من الصوصات والتوابل والمكونات المختلفة، ومن أشهرها، طبق “باستا الأنجِل هير مع صوص الأماتريشانا”، ويتكون هذا الطبق من اللحم، والكوسة، والفول وطبق “بيتزا بافالينا”، والذي يتكون من العجينة الرقيقة والمحمّصة من الأطراف ويوضع عليها أنواع الفلفل، التين، الليمون، الفطر، والخضراوات الورقيّة والجبن موزاريلا بافالو، مع صوص طماطم سان مارزانو."),
    BlogPosts(id: 1, name: "انجلترا", image: "1", details: " ويتميز المطبخ الإنجليزي بطبق “Fish and Chips” أي السمك القد والبطاطس المقلية، والذي يعد واحد من أشهر الوجبات الإنجليزية، حيث يتم قلي السمك حتى يحصل على اللون الذهبي وعادة يتم إضافة البازلاء محمرة أو مهروسة إلى الطبق، وفي بعض الأحيان قد تجد طبق من حلقات البصل المحمرة كطبق جانبي ولكن يجب عليك أن تطلبه بنفسك."),
]
