//
//  BlogModel.swift
//  blog project
//
//  Created by Amal on 18/03/1443 AH.
//

import Foundation

struct Blog {
    var image   : String
    var caption = "Blog"
    var title   : String
    var desc    : String
    var author  = "Amal"
    var authorName = "Amal Alfaifi"
}

class BlogPosts {
    static let posts = [
        
        Blog(image: "ma", caption: "blog", title: "كن رحيما مع نفسك", desc: "كن رحيمًا مع نفسك وأدرك كل الطرق التي جعلتك بها المحن قوية .. الأشخاص الذين يواجهون بعض المحن في حياتهم يصبحون أقوى."),
        
        Blog(image: "33", caption: "blog", title: "عيوننا الخفيه", desc:
                 " ، اذا كانت المشاعر لغه فمن المؤكد أنها تبدو سهلة للغاية ، فهي ظاهرة غريبة بالنسبة لنا ، لأننا نجد أنفسنا في نوع فردي وشخصي تمامًا ، وهي تجربة يصعب علينا تمييزها أحيانًا فهمها ناهيك عن القدرة على ذلك." ),
        
        Blog(image: "ho", caption: "blog", title: "المرونه النفسيه", desc: "المرونة النفسية وأهم النصائح لاكتسابها: 1- لا تنتظر حتى يصلح الموقف نفسه يميل الأشخاص الصامدون إلى القول: ما الذي سأفعله حيال ذلك؟ بدلا من كم من الوقت سوف أنجو من هذا؟ 2- تعرف على نقاط قوتك واستخدمها بشكل عام ، يميل الأشخاص الأكثر مرونة إلى استخدام نقاط قوتهم. بغض النظر عن المهارات والمواهب التي تمتلكها ، استخدمها لتجاوزها."),
    
    ]
}
